---
kind: property
id: P:Autodesk.Revit.DB.ViewShapeBuilder.ViewType
source: html/7dc1fc02-b8f5-6552-54c4-6cce64119c39.htm
---
# Autodesk.Revit.DB.ViewShapeBuilder.ViewType Property

View type where the view-specific shape currently being built will be used

## Syntax (C#)
```csharp
public DirectShapeTargetViewType ViewType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration